USE PersonnellRecords;
GO

DELETE FROM Resumes;
DELETE FROM Workers;
DELETE FROM Vacancy;
DELETE FROM State;
DELETE FROM Logins;
GO 

DBCC CHECKIDENT ('Logins', RESEED, 0);
DBCC CHECKIDENT ('State', RESEED, 0);
DBCC CHECKIDENT ('Workers', RESEED, 0);
DBCC CHECKIDENT ('Vacancy', RESEED, 0);
DBCC CHECKIDENT ('Resumes', RESEED, 0);
GO 

SET DATEFORMAT ymd;
GO

INSERT INTO Logins (Login, FIO, Password, Email) VALUES
(N'admin', N'Степанов В.С.', N'admin', N'admin@gmail.com'),
(N'test', N'Васильев А.В.', N'test', N'test@mail.ru');
GO

INSERT INTO State (Division, Post, NumberOfWorkers, NumberOfHours, Salary) VALUES
(N'Администрация', N'Гл. администратор', 1, 40, 70000),
(N'Администрация', N'Администратор', 2, 40, 56000),
(N'Администрация', N'Администратор ст.', 1, 40, 62000),
(N'Отдел кадров', N'Рекрутер', 1, 40, 45000),
(N'Финансовый отдел', N'Финансовый директор', 1, 40, 47800),
(N'Отдел логистики', N'Гл. менеджер', 2, 40, 52000), 
(N'IT-отдел', N'Программист 1С', 3, 40, 95000),
(N'Служба сервиса', N'Уборщик', 2, 20, 20000),
(N'Кухня', N'Повар', 2, 40, 40000),
(N'Библиотека', N'Библиотекарь', 1, 32, 28000);
GO

INSERT INTO Workers (FIO, DateOfBirth, Division, Post, INN, Address, DateOfReception, Family, Education, Awards) VALUES
(N'Леванченко С.А.', '1985-04-12', N'Администрация', N'Гл. администратор', '395728495738', N'ул. Пушкина д.14 кв.36', '2024-10-01', N'жена, дети', N'НКЭиВТ', N'грамота'),
(N'Петров В.С.', '1990-09-21', N'Администрация', N'Администратор', '694738563063', N'ул. Василевская д.173', '2024-11-15', N'жена', N'НГИ', N'-'),
(N'Иванов М.У.', '1993-02-05', N'Отдел кадров', N'Рекрутер', '457687375908', N'ул. Вивальди д.49 кв.25', '2024-11-01', N'-', N'НГУ', N'-'),
(N'Добрыня Т.К.', '1980-11-30', N'Финансовый отдел', N'Финансовый директор', '142749573950', N'ул. Прохоровка д.59 кв.148', '2024-12-20', N'жена', N'НГУ', N'грамота'),
(N'Оценка Т.П.', '1988-07-14', N'Администрация', N'Администратор ст.', '564544660938', N'ул. Амосова д.55 кв.189', '2024-12-24', N'жена, дети', N'НКЭиВТ', N'-'),
(N'Змееед В.К.', '1995-05-18', N'Отдел логистики', N'Гл. менеджер', '327836275938', N'ул. Ленина д.4 кв.48', '2024-12-05', N'жена, ребёнок', N'НГУ', N'-'),
(N'Сидоров А.А.', '1992-03-25', N'IT-отдел', N'Программист 1С', '770102030405', N'ул. Мира 10', '2025-01-10', N'холост', N'НГТУ', N'благодарность'),
(N'Кузнецова Е.В.', '1996-08-14', N'Администрация', N'Администратор', '540102030406', N'ул. Маркса 5', '2025-02-20', N'замужем', N'НГУЭУ', N'-'),
(N'Смирнов Д.И.', '1987-10-05', N'Отдел логистики', N'Гл. менеджер', '540203040507', N'ул. Кирова 25', '2025-03-01', N'женат, двое детей', N'СГУПС', N'-');
GO

INSERT INTO Vacancy (Post, Conditions) VALUES
(N'Уборщик', N'Без опыта работы, график 5/2'),
(N'Повар', N'Опыт работы не менее двух лет, образование в кулинарном техникуме, график 5/2'),
(N'Библиотекарь', N'График 4/3'),
(N'Системный администратор', N'График работы 5/2, опыт работы не менее двух лет'),
(N'Разработчик 1С', N'Опыт работы не менее двух лет, удалённая работа');
GO

INSERT INTO Resumes (FIO, VacancyId, Link) VALUES
(N'Мотыгин Т.Д.', 1, 'google.com'),
(N'Степанов А.С.', 5, 'google.com'),
(N'Федоров И.И.', 2, 'google.com'),
(N'Алексеева М.В.', 3, 'google.com'),
(N'Григорьев К.С.', 4, 'google.com'),
(N'Николаев А.Н.', 5, 'google.com'),
(N'Васильев В.В.', 1, 'google.com'),
(N'Михайлов М.М.', 2, 'google.com');
GO